lista2/resolução/lista.org
#+title: Lista de Exercícios 2
#+author: Adriel Benati de Melo
#+date: 12 de Janeiro
#+latex_class: article
#+options: toc:nil num:nil

* 4)

** a) e b)

Tomado o conjunto (7, 8, 6, 10, 5, 9, 4, 12, 7, 8), tem-se que:

#+begin_src R :results output :exports both 
  conjunto <- c(7, 8, 6, 10, 5, 9, 4, 12, 7, 8)

  media <- mean(conjunto)
  desvp <- sd(conjunto)

  cat(sprintf('Média do conjunto =  %1.0f\n', media))
  cat(sprintf('Desvio padrão do conjunto = %1.0f\n', desvp))
#+end_src

#+RESULTS:
: Média do conjunto =  8
: Desvio padrão do conjunto = 2

* 13)

#+begin_src R :results output :exports both
  ## gambiarra dos infernos que tive que fazer pra chegar nesse conjunto
  ## de dados!

  filhos <- c(1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2,
  2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
  2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3,
  3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 4,
  4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4,
  4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4,
  4, 4, 4, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
  5, 5, 5, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6,
  6, 6, 6, 7, 7, 7, 7, 7, 7, 7, 7, 7, 8, 8, 8, 8, 8, 8, 8, 9, 9, 9, 9,
  9, 9, 9, 9, 9, 10, 10, 11, 11, 11, 12, 12)

  cbind(summary(filhos))
#+end_src

#+RESULTS:
:              [,1]
: Min.     1.000000
: 1st Qu.  2.000000
: Median   4.000000
: Mean     4.306977
: 3rd Qu.  6.000000
: Max.    12.000000

* 19)

** a)

Utilizando-se do programa em R a seguir, é possível determinar o
diagrama de ramo-e-folhas.

#+begin_src R :results output :exports both
  dist <- c(1.8, 2.5, 0.4, 1.9, 4.4, 2.2, 3.5, 0.2, 0.9, 1.4, 1.1,
  1.7, 1.2, 2.3, 1.9, 0.8, 1.5, 1.7, 1.4, 2.1, 3.2, 15.1, 2.1, 1.4,
  0.5, 0.9, 1.7, 0.5, 0.8, 3.7, 1.4, 1.8, 2.0, 1.1, 1.0, 0.8)

  stem(dist, scale = 2)
#+end_src

** b)

#+begin_src R :results output :exports both
  dist <- c(1.8, 2.5, 0.4, 1.9, 4.4, 2.2, 3.5, 0.2, 0.9, 1.4, 1.1, 1.7, 1.2, 2.3, 1.9, 0.8, 1.5, 1.7, 1.4, 2.1, 3.2, 15.1, 2.1, 1.4, 0.5, 0.9, 1.7, 0.5, 0.8, 3.7, 1.4, 1.8, 2.0, 1.1, 1.0, 0.8)

  aaa <- summary(dist)

  ccc <- c(0.4, 1.6, 2.8, 4.2, 8.8)
  bbb <- summary(ccc)

  cbind(aaa, bbb)
#+end_src

#+RESULTS:
:            aaa  bbb
: Min.     0.200 0.40
: 1st Qu.  0.975 1.60
: Median   1.600 2.80
: Mean     2.025 3.56
: 3rd Qu.  2.100 4.20
: Max.    15.100 8.80

Comparando os dados da empresa AAA e BBB, percebe-se que a empresa AAA é a que tem o os extremos mais notáveis, com um extremo superior de 15,1 comparado ao de 8,80 da empresa BBB. Exceto isso, os valores da empresa BBB são em geral mais altos que os da empresa AAA, indicando que os funcionários daquela viajam mais do que os desta.

** c)

#+begin_src R :results output :exports none
  dist <- c(1.8, 2.5, 0.4, 1.9, 4.4, 2.2, 3.5, 0.2, 0.9, 1.4, 1.1, 1.7, 1.2, 2.3, 1.9, 0.8, 1.5, 1.7, 1.4, 2.1, 3.2, 15.1, 2.1, 1.4, 0.5, 0.9, 1.7, 0.5, 0.8, 3.7, 1.4, 1.8, 2.0, 1.1, 1.0, 0.8)

  aaa <- summary(dist)

  bbb <- c(0.4, 1.6, 2.8, 4.2, 8.8)

  png(file = "boxplot.png")

  boxplot(aaa, bbb,
          main = "Diagrama de caixas: comparação entre AAA e BBB",
          names  = c('aaa', 'bbb'))

  dev.off()
#+end_src


